In [1]:
import glob
import pandas as pd

In [2]:
#####################################
#Read one stand alone scan of the data (scan 0), plot it, and list x/y data points

In [3]:
# Read table into pandas
query1 = pd.read_table('C:\\Users\Jesse\Documents\FILES\BATTERY_DATA_ANALYSIS\DATA/bat13_x19z00y03_2.xy', header=None).loc[6:8197]

# Strip Text and Expand into two columns
query2 = query1[0].str.strip().str.split(' ',expand=True).set_index(0)
#set data type
query2[1] = query2[1].astype(int)

In [4]:
# print x y data
query2.head(3)

    1
0
1   0
2  10
3  15

In [5]:
#plot x y data
query2.plot()

In [6]:
###################
# New Section
#######################

# List Data Definitions

In [7]:

query2a = pd.read_table('C:\\Users\Jesse\Documents\FILES\BATTERY_DATA_ANALYSIS\DATA/bat13_x19z00y03_2.xy', header=None)

In [36]:
#First line of file - Data Defintions needed. 
line1 = query2a[0:1]
line1_querya=line1[0].str.split(' ',expand=True)
line1_querya.to_csv('C:\\Users\Jesse\Documents\BATTERY DATA ANALYSIS/Data1.csv')

In [46]:
#xr yr zr data defintion file builder
pd.read_csv('C:\\Users\Jesse\Documents\BATTERY DATA ANALYSIS/Data1.csv')

   Unnamed: 0   0   1    2  3
0           5 NaN  19  3.5  0

In [9]:
#Second line of file  - Data defintions needed. 
line2 = query2a[1:2]
line2

                                                   0
1  # sl1r sl1l sl1t sl1b sl2r sl2l sl2t sl2b sl3r...

In [10]:
line2_query_a = line2[0].str.split(' ',expand=True)
line2_query_a

,0,1,2,3,4,5,6,7,8,9,...,27,28,29,30,31,32,33,34,35,36
1,#,sl1r,sl1l,sl1t,sl1b,sl2r,sl2l,sl2t,sl2b,sl3r,...,m27,m28,m29,m30,m31,ush,usv,dsh,dsv,

In [12]:
#Third line of file - Data defintions needed - Do these represent energy levels of certain particles?
line3 = query2a[2:3]
line3

                                                   0
2  # 2 2 0.03 0 1 1 5 5.01 10 10 0.1 0.1 4 4 0.4 ...

In [13]:
line3_query_a = line3[0].str.split(' ',expand=True)
line3_query_a

,0,1,2,3,4,5,6,7,8,9,...,27,28,29,30,31,32,33,34,35,36
2,#,2,2,0.03,0,1,1,5,5.01,10,...,0,0,0,0,0.39025,0,-0.25,0,0.25,

In [61]:
line2_query_a.append(line3_query_a).to_csv('C:\\Users\Jesse\Documents\BATTERY DATA ANALYSIS/Data4.csv')
pd.read_csv('C:\\Users\Jesse\Documents\BATTERY DATA ANALYSIS/Data4.csv')

,Unnamed: 0,0,1,2,3,4,5,6,7,8,...,27,28,29,30,31,32,33,34,35,36
0,1,#,sl1r,sl1l,sl1t,sl1b,sl2r,sl2l,sl2t,sl2b,...,m27,m28,m29,m30,m31,ush,usv,dsh,dsv,NaN
1,2,#,2,2,0.03,0,1,1,5,5.01,...,0,0,0,0,0.39025,0,-0.25,0,0.25,NaN

In [14]:
#Fourth line of file - Appears to be scan count and time/date
line4 = query2a[3:4]
line4

                                  0
3  #Scan 0 Fri Jul 24 02:49:35 2015

In [58]:
#Fifth line of file - Need data definitions.
line5 = query2a[4:5]
line5[0].str.split(' ',expand=True).to_csv('C:\\Users\Jesse\Documents\BATTERY DATA ANALYSIS/Data3.csv')
pd.read_csv('C:\\Users\Jesse\Documents\BATTERY DATA ANALYSIS/Data3.csv')

,Unnamed: 0,0,1,2,3,4,5,6,7,8,9,10,11
0,4,#At,end,of,"scan,",counts:,0.983718,NaN,7957,NaN,1298,NaN,0

In [56]:
# Extract xr yr zr data - Need data defintions
query2b = query2a[5:6]
query2c = query2b[0].str.split('=',expand=True)
query2d = query2c[1].str.split(' ',expand=True)
query2d

  0   1    2  3
5    19  3.5  0

In [57]:
# Send x y z data to csv for data defintions
query2b[0].str.split(' ',expand=True).to_csv('C:\\Users\Jesse\Documents\BATTERY DATA ANALYSIS/Data2.csv')
pd.read_csv('C:\\Users\Jesse\Documents\BATTERY DATA ANALYSIS/Data2.csv')

   Unnamed: 0    0   1   2  3   4    5  6
0           5  #xr  yr  zr  =  19  3.5  0

In [17]:
#XY Data
query2.head()

    1
0
1   0
2  10
3  15
4  18
5  51

In [62]:
# Hey Will, does line 2 and 3 correspond to one another?
combine_query = line2_query_a.append(line3_query_a) # appends line 3 to line 2, and prints the table below
combine_query.T.to_csv('C:\\Users\Jesse\Documents\BATTERY DATA ANALYSIS/Data5.csv') # send data to csv

In [28]:
pd.read_csv('C:\\Users\Jesse\Documents\BATTERY DATA ANALYSIS/Data.csv') # read data that was sent to csv

    Unnamed: 0     1        2
0            0     #        #
1            1  sl1r        2
2            2  sl1l        2
3            3  sl1t     0.03
4            4  sl1b        0
5            5  sl2r        1
6            6  sl2l        1
7            7  sl2t        5
8            8  sl2b     5.01
9            9  sl3r       10
10          10  sl3l       10
11          11  sl3t      0.1
12          12  sl3b      0.1
13          13  sl4r        4
14          14  sl4l        4
15          15  sl4t      0.4
16          16  sl4b      0.4
17          17    xr       19
18          18    yr  13.9492
19          19    zr        0
20          20  ytth  -37.259
21          21   tth       -3
22          22   m22        0
23          23   m23    0.942
24          24   m24    0.945
25          25   m25        0
26          26   m26        0
27          27   m27        0
28          28   m28        0
29          29   m29        0
30          30   m30        0
31          31   m31  0.39025
32          32   ush        0
33          33   usv    -0.25
34          34   dsh        0
35          35   dsv     0.25
36          36   NaN      NaN

In [19]:
##############################################

#New Section

##############################################

#Combine All Files


# using glob function, create a list of all the files in the directory of the laboratory research results
all_files = glob.glob('C:\\Users\Jesse\Documents\FILES\BATTERY_DATA_ANALYSIS\DATA\*.xy')

In [20]:
#using the "all_files" glob function from above, iterate over the files and append them to a list named "data_processor"
data_processor = []
for file in all_files:
    data_read = pd.read_table(file,header=None)
    data_processor.append(data_read)
    
data = pd.concat(data_processor)

In [29]:
#display the first 3 rows of the data
data.head(10)

                                                   0
0  #COMMAND: motor_cam bat13_x19z00y03_10 yr 3.5 ...
1  # sl1r sl1l sl1t sl1b sl2r sl2l sl2t sl2b sl3r...
2  # 2 2 0.03 0 1 1 5 5.01 10 10 0.1 0.1 4 4 0.4 ...
3                   #Scan 0 Fri Jul 24 19:22:43 2015
4   #At end of scan, counts: 0.983718  7957  1298  0
5                               #xr yr zr = 19 3.5 0
6                                                1 0
7                                               2 12
8                                               3 17
9                                               4 30

In [22]:
#display the last 3 rows of the data
data.tail(3)

             0
122925  8190 2
122926  8191 0
122927  8192 1

In [23]:
#display general info on the data
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 17660081 entries, 0 to 122927
Data columns (total 1 columns):
0    object
dtypes: object(1)
memory usage: 269.5+ MB